Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: If enabled, Drupal will display some basic HTML help in the long filter tips.
be: Калі актывізавана, Drupal будзе адлюстроўваць базавую дапамогу па HTML.

source: If left empty, "0" will be used.
be: Калі пакінуць пустым, будзе выкарыстаны "0".

source: If left empty, "1" will be used.
be: Калі пакінуць пустым, будзе выкарыстоўвацца "1".

source: If more than one application will be sharing this database, enter a table prefix such as %prefix for your @drupal site here.
be: Калі больш за адну сістэму выкарыстоўвае адну і тую ж базу дадзеных, устаўце прэфікс табліцы у выглядзе %prefix.

source: If no image is uploaded, this image will be shown on display and will override the field's default image.
be: Калі ні адзін малюнак не загружаны, на экране будзе адлюстроўвацца гэты малюнак і зменіць малюнак па змоўчанню.

source: If no image is uploaded, this image will be shown on display.
be: Калі ніякі малюнак не загружаны, гэты малюнак будзе адлюстоўвацца на экране.

source: If selected and this menu item has children, the menu will always appear expanded.
be: У выпадку выбару меню, якое ўтрымлівае падпункты, яно будзе заўжды паказвацца ў разгорнутым выглядзе.

source: If selected and this menu link has children, the menu will always appear expanded.
be: Калі выдзеленая і гэта спасылка меню маюць дачынныя элементы, то меню будзе заўседы з'яўляцца ў разгорнутым выглядзе.

source: If the PHP option is chosen, enter PHP code between %php. Note that executing incorrect PHP code can break your Drupal site.
be: Калі абраны варыянт уводу PHP, увядзіце PHP код паміж %php. Заўважце, што выкананне некарэктнага PHP кода мжа зламаць ваш Drupal сайт.

source: If the PHP-mode is chosen, enter PHP code between %php. Note that executing incorrect PHP-code can break your Drupal site.
be: Калі абраны PHP-рэжым, увядзіце PHP-код паміж %php. Увага: выкананне некарэктнага PHP-кода можа пашкодзіць Ваш сайт.

source: If the amount of boxes above isn't enough, click here to add more choices.
be: Калі колькасць блокаў вышэй не з'яўляецца дастатковай, націсніце тут, каб дадаць больш варыянтаў.

source: If the site is experiencing problems with permissions to content, you may have to rebuild the permissions cache. Rebuilding will remove all privileges to content and replace them with permissions based on the current modules and settings. Rebuilding may take some time if there is a lot of content or complex permission settings. After rebuilding has completed, content will automatically use the new permissions.
be: Калі сайт мае праблемы з правамі доступу да змесціва, вы можаце аднавіць правы кэша. Аднаўленне выдаліць усе прывілеі да змесціва і заменіць іх правамі доступу на аснове бягучых модуляў і наладак. Аднаўленне можа заняць некаторы час, калі маецца шмат змесціва або складаных наладак дазволу. Пасля завяршэння аднаўлення, змесціва будзе аўтаматычна карыстацца новымі правамі даступу.

source: If this style is in use on the site, you may select another style to replace it. All images that have been generated for this style will be permanently deleted.
be: Калі гэты стыль ужо выкарыстоўваецца на сайце, то вы можаце выбраць іншы стыль для замены гэтага. Усе малюнкі, якія былі створаны для гэтага стыля, будуць назаўсёды выдалены.

source: If toggled on, the following logo will be displayed.
be: Калі рэгулятар запалены, будзе паказвацца наступнае лёга.

source: If you already have an OpenID, enter the URL to your OpenID server below (e.g. myusername.openidprovider.com). Next time you log in, you will be able to use this URL instead of a regular username and password. You can have multiple OpenID servers if you like; just keep adding them here.
be: Калі вы ўжо маеце OpenID, увядзіце URL да вашага OpenID сервера ніжэй (напрыклад, myusername.openidprovider.com). Пры наступным ўваходзе, вы сможаце выкарыстоўваць гэты URL замест звычайнага імя карыстальніка і пароля. Пры жаданні, вы можаце мець некалькі OpenID сервераў; дадавайце іх тут.

source: If you are unfamiliar with PHP, SQL, or Drupal, avoid using custom PHP code within posts. Experimenting with PHP may corrupt your database, render your site inoperable, or significantly compromise security.
be: Калі вы не знаёмы з PHP, SQL, ці Drupal, пазбягайце выкарыстоўваць уласны PHP код у постах. Эксперыментаванне з PHP можа пашкодіць вашу базу дадзеных, вывесці ваш сайт непрыдатным для карыстання ці сур'ёзна пашкодзіць бяспеку.

source: If you are upgrading to a newer version of Drupal or upgrading contributed modules or themes, you may need to run the <a href="@update-php">update script</a>.
be: Калі Вы хочаце абнавіць да найноўшай версіі Drupal, ці абнавіць дадатковыя модулі ці тэмы, Вам, магчыма, прыйдзецца запусціць <a href="@update-php">абнавіць скрыпт</a>.

source: If you do encounter problems, try using HTML character entities. A common example looks like &amp;amp; for an ampersand &amp; character. For a full list of entities see HTML's <a href="@html-entities">entities</a> page. Some of the available characters include:
be: Калі праблемы ўсё ж паўстаюць, паспрабуйце выкарыстаць адмысловыя пазначэнні для сімвалаў у HTML. Напрыклад, &amp;amp; замест сімвала амперсанта &amp;. Паглядзець поўны спіс такіх пазначэнняў можна на старонцы <a href="@html-entities">Спецыяльных HTML-сімвалаў</a>. Некаторыя з даступных HTML-сімвалаў:</p>

source: If you don't have direct file access to the server, use this field to upload your logo.
be: Калі ў Вас няма простага дасягу да файлавага сэрвэру, то скарыстайцеся з гэтага полю, каб запампаваць лягатып.

source: If you don't have direct file access to the server, use this field to upload your shortcut icon.
be: Калі ў Вас няма простага дасягу да сэрвэру, скарыстайцеся з гэтага полю, каб запампаваць абразок.

source: If you don't want to receive such e-mails, you can change your settings at !recipient-edit-url.
be: Калі вы не жадаеце атрымліваць такія емэйлы, вы можаце змяніць свае наладкі на старонцы !recipient-edit-url.

source: If you have any content left in this field, it will be lost. This action cannot be undone.
be: Калі ў гэтым поле пакінута нейкае змесціва, яно будзе згубленае. Гэтае дзеянне не можа быць адменена.

source: If you have any content left in this input format, it will be switched to the default input format. This action cannot be undone.
be: Калі ў гэтым фармаце ёсць нейкі тэкст, то ён будзе перафарматаваны ў фармат па змоўчанні. Увага: гэтае дзеянне нельга скасаваць.

source: If you have chosen this shortcut set as the default for some or all users, they may also be affected by deleting it.
be: Калі вы абралі гэты набор хуткіх спасылак па змоўчанні для некалькіх ці ўсіх карыстальнікаў, выдаленне набору будзе ўздзенічаць на іх.

source: If you have problems accessing administrative pages on this site, disable the overlay on your profile page.
be: Калі ў вас на гэтым сайце ёсць праблемы з доступам да старонак адміністравання, выключце перакрываючы слой на старонцы вашага профілю.

source: If you made a significant change, which means translations should be updated, you can flag all translations of this post as outdated. This will not change any other property of those posts, like whether they are published or not.
be: Калі вы ўнеслі значныя змены, што азначае, што пераклады павінны быць абноўлены, вы можаце пазначыць усе пераклады гэтага поста як састарэлыя. Гэта ня зменіць любыя іншыя ўласцівасці гэтых пастоў, як быццам бы яны з'яўляюцца апублікаванымі ці не.

source: If you move this topic, you can leave a link in the old forum to the new forum.
be: Калі Вы перасоўваеце абмеркаваньне на новае месца, Вы можаце пакінуць на старым форуме спасылку на яго актуальнае месцазнаходжаньне.

source: If you would like additional text to appear on the site-wide contact page, use a block. You can create and edit blocks on the <a href="@blocks">Blocks administration page</a>.
be: Калі вы хочаце, каб дадатковы тэкст з'явіўся на агульнай старонцы кантактаў, выкарыстоўвайце блок. Вы можаце ствараць і рэдагаваць блокі на старонцы <a href="@blocks">Адміністраванне блокаў</a>.

source: If you would like additional text to appear on the site-wide or personal contact page, use a block. You can create and edit blocks on the <a href="@blocks">Blocks administration page</a>.
be: Калі вы жадаеце, каб дадатковы тэкст з'явіўся на ўсіх старонках сайту або на асабістай старонцы кантактаў, выкарыстоўвайце блок. Вы можаце ствараць і рэдагаваць блокі на <a href="@blocks">Старонцы адміністравання блокаў</a>.

source: If your database is located on a different server, change this.
be: Калі ваша база дадзеных знаходзіцца на іншым серверы, памяняйце гэта значэнне.

source: If your database server is listening to a non-standard port, enter its number.
be: Калі ваш сервер базы дадзеных выкарыстоўвае нестандартны пор, устаўце нумар парта

source: Igbo
be: Ігба

source: Illegal choice %choice in !name element.
be: Не дазволены %choice у элеменце !name.

source: Illegal choice %choice in %name element.
be: Памылка выбара варыянтаў наладак: %choice у %name.

source: Image
be: Малюнак

source: Image !current of !total
be: Малюнак !current з !total

source: Image crop failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
be: Не атрымалася зрабіць абрэзку малюнка, выкарыстоўваючы набор інструментаў %toolkit па сцежцы %path (%mimetype, %dimensions)

source: Image deleted.
be: Выява выдалена.

source: Image desaturate failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
be: Не атрымалася зменшыць насычанасць малюнака, выкарыстоўваючы набор інструментаў %toolkit па сцежцы %path (%mimetype, %dimensions)

source: Image generation in progress. Try again shortly.
be: Утварэнне малюнка ў працэсе. Паспрабуйце зноў праз кароткі прамежак часу.

source: Image module also allows you to attach images to content as fields. To add an image field to a <a href='@content-type'>content type</a>, go to the content type's <em>manage fields</em> page, and add a new field of type <em>Image</em>. Attaching images to content this way allows image styles to be applied and maintained, and also allows you more flexibility when theming.
be: Модуль Image дазваляе вам далучаць малюнкі да змесціва ў якасці палёў. Каб дабавіць поле малюнка да <a href='@content-type'>тыпу змесціва</a>, перайдзіце на старонку <em>кіравання палямі</em> тыпу змесціва, і дадайце новае поле тыпу <em>Малюнак</em>.Пры далучэнні малюнкаў такім чынам, гэта дазваляе ўжываць і падтрымліваць стылі малюнка, а таксама дае вам больш магчымасцяў пры тэмізацыі.

source: Image resize failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
be: Не атрымалася змяніць памеры малюнка, выкарыстоўваючы набор інструментаў %toolkit па сцежцы %path (%mimetype, %dimensions)

source: Image rotate failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
be: Не атрымалася здзейсніць паварот малюнку, выкарыстоўваючы набор інструментаў %toolkit па сцежцы %path (%mimetype, %dimensions)

source: Image scale and crop failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
be: Не атрымалася зрабіць маштабаванне і абрэзку малюнка, выкарыстоўваючы набор інструментаў %toolkit па сцежцы %path (%mimetype, %dimensions)

source: Image scale failed using the %toolkit toolkit on %path (%mimetype, %dimensions)
be: Не атрымалася зрабіць маштабаванне малюнка, выкарыстоўваючы набор інструментаў %toolkit па сцежцы %path (%mimetype, %dimensions)

source: Image size
be: Памер малюнка

source: Image style
be: Стыль выявы

source: Image style name
be: Назва малюнка стыля

source: Image style: @style
be: Стыль выявы: @style

source: Image styles
be: Стылі малюнка

source: Image styles commonly provide thumbnail sizes by scaling and cropping images, but can also add various effects before an image is displayed. When an image is displayed with a style, a new file is created and the original image is left unchanged.
be: Стылі малюнкаў звычайна прадастаўляюць мініяцюры маштабаваных і абрэзаных малюнкаў, але могуць таксама дадаваць розныя эфекты перад вывадам малюнка. Калі малюнак адлюстроўваецца са стылем, тады ужо новы файл ствароны з арыгінальнага малюнка застаецца нязмененым.

source: Image toolkit
be: Набор інструментаў для малюнкаў

source: Images
be: Малюнкі

source: Images must be between !min and !max pixels.
be: Малюнкі павінны быць памерам ад !min да !max пікселяў.

source: Images must be exactly !size pixels.
be: Малюнкі павінны быць размерам дакладна ў !size пікселяў.

source: Images must be larger than !min pixels.
be: Малюнкі павінны быць большыя чым !min пікселяў.

source: Images must be smaller than !max pixels.
be: Малюнкі павінны быць меньшыя чым !max пікселяў.

source: Import
be: Імпарт

source: Import OPML
be: Імпарт OPML

source: Import into
be: Імпартаваць да

source: Import translation
be: Імпарт пераклада

source: Imported %file into %locale: %number new strings added, %update updated and %delete removed.
be: Імпартаваны %file у %locale: %number дадаў новыя радкі, %update абнавіў і %delete перанёс.

source: Imported translations will be added to this text group.
be: Імпартаваныя пераклады будуць дададзены да гэтай тэкставай групы.

source: Importing files from a set of existing translations, known as a translation package. A translation package enables the display of a specific version of Drupal in a specific language, and contains files in the Gettext Portable Object (<em>.po</em>) format. Although not all languages are available for every version of Drupal, translation packages for many languages are available for download from the <a href="@translations">Drupal translations page</a>.
be: Імпартаванне файлаў з набору існуючых перакладаў, вядомых як пакет перакладу. Пакет перакладу дае магчымасць адлюстравання вызначанай версіі Drupal на вызначанай мове, і утрымлівае файлы ў фармаце Gettext Portable Object (<em>.po</em>). Хоць і ня ўсе мовы даступны для кожнай версіі Drupal, аднак пакеты перакладаў для мноства моў дастпуны для спампавання з <a href="@translations">старонкі Пераклады Drupal</a>.

source: Importing interface translations
be: Імпарт перакладаў інтэрфейсу

source: In case of errors or problems with the site, the <a href="@dblog">Recent log messages</a> page can be useful for debugging, since it shows the sequence of events. The log messages include usage information, warnings, and errors.
be: У выпадку памылак альбо праблем з сайтам, старонка <a href="@dblog">Апошніх паведамленныяў журнала</a> можа быць карысна для адладкі. Яна паказвае паслядоўнасць падзей. Журнал паведамленняў уключае звычайную інфармацыі, папярэджанні і памылкі.

source: In moderation queue
be: У чарзе на мадэрацыю

source: In order for Drupal to work, and to continue with the installation process, you must resolve all permission issues reported above. We were able to verify that we have permission for the following commands: %commands. For more help with configuring your database server, see the <a href="http://drupal.org/node/258">Installation and upgrading handbook</a>. If you are unsure what any of this means you should probably contact your hosting provider.
be: Для таго, каб Drupal працаваў, і каб працягнуць працэс устаноўкі, вы павінны вырашыць усе пытанні дазволу, аб якіх гаварылася вышэй. Мы змаглі пераканацца, што мы маем дазвол на наступныя каманды: %commands. Дадатковую інфармацыю пра наладу сервера баз дадзеных, гл. <a href="http://drupal.org/node/258">Кіраўніцтва па ўталёўцы і мадэрнізацыі</a>. Калі вы не ведаеце, што ўсё гэта азначае, то Вам, верагодна, варта звярнуцца да хостынг-правайдэра.

source: In order for the site and its modules to continue to operate well, a set of routine administrative operations must run on a regular basis. The System module manages this task by making use of a system cron job. You can verify the status of cron tasks by visiting the <a href="@status">Status report page</a>. For more information, see the online handbook entry for <a href="@handbook">configuring cron jobs</a>. You can set up cron job by visiting <a href="@cron">Cron configuration</a> page
be: Для таго, каб сайт і яго модулі працягвалі добра працаваць, неабходна рэгулярна ажыццяўляць комплекс адміністратыўных аперацый. Сістэмны модуль ажыццяўляе гэту задачу праз працу сістэмнага крона. Вы можаце праверыць статус задач крона праз <a href="@status">Старонка справаздачы статуса</a>. Для больш падрабязнай інфармацыі глядзіце запіс анлайн даведніка <a href="@handbook">Наладка працы крона</a>. Вы можаце вызначыць працу крона на старонцы <a href="@cron">Наладка крона</a>

source: In your %settings_file file you have configured @drupal to use a %db_type server, however your PHP installation currently does not support this database type.
be: У вашым файле настроек %settings_file вы сканфігуравалі @drupal выкарыстоўваць базу %db_type, але настройкі РНР не дазваляюць выкарыстоўваць гэты тып базы.

source: In your %settings_file file you have configured @drupal to use a %driver server, however your PHP installation currently does not support this database type.
be: У вашым %settings_file файле вы наладзілі @drupal выкарыстоўваць %driver сервер, аднак ваша канфігурацыя PHP у дадзены момант не падтрымлівае гэты тып базы дадзеных.

source: Inactive fields are not shown unless their providing modules are enabled. The following fields are not enabled: !list
be: Неактыўныя палі ня будуць паказаны, пакуль модулі, якія іх забяспечваюць, ўключаны. Наступныя палі ня ўключаны: !list

source: Include file in display
be: Улучыць файл для адлюстравання

source: Includes:
be: Уключае ў сябе:

source: Includes: %includes
be: Уключае ў сябе: %includes

source: Incompatible with this version of Drupal core.
be: Несумяшчальна з гэтай версіяй ядра Drupal

source: Incompatible with this version of PHP
be: Несумяшчальна з гэтай версіяй PHP

source: Increase the memory limit by editing the memory_limit parameter in the file %configuration-file and then restart your web server (or contact your system administrator or hosting provider for assistance).
be: Павялічце ліміт памяці memory_limit параметра ў файле %configuration-file і перазапусціце ваш вэб-сервер (альбо звяжыцеся з адмінітратарам ці хостынг правайдэрам па дапамогу).

source: Increment a counter each time content is viewed.
be: Павялічваць лічыльнік кожны раз, калі нехта праглядае матэрыял.

source: Index
be: Каталог (індэкс)

source: Indexed %count content items for tracking.
be: Індэксаваны %count элементаў змесціва для адсочвання.

source: Indexing behavior can be adjusted using the <a href="@searchsettings">Search settings page</a>. Users with <em>Administer search</em> permission can control settings such as the <em>Number of items to index per cron run</em>, <em>Indexing settings</em> (word length), <em>Active search modules</em>, and <em>Content ranking</em>, which lets you adjust the priority in which indexed content is returned in results.
be: Паводзіны індэксацыі можна наладзіць з дапамогай <a href="@searchsettings">Старонцы настроек пошуку</a>. Карыстальнікі з дазволам<em>Адміністраванне пошуку</em> могуць кантраляваць такія параметры, як <em>Колькасць элементаў індэксацыі на выкананне крона</em>, <em>Налады індэксацыі</em> (даўжыня слова), <em>Актыўныя модулі пошуку</em> і <em>Рэйтынг змесціва</em>, які дазваляе наладжваць прыярытэт вяртання індэксаванага змесціва ў выніках.

source: Indexing content with cron
be: Індэксацыя змесціва у кроне.

source: Indexing settings
be: Наладкі індэксацыі

source: Indexing status
be: Статус індэксацыі

source: Indexing throttle
be: Рэгулятар індэксацыі

source: India
be: Індыя

source: Individual content types can have different fields, behaviors, and permissions assigned to them.
be: Асобныя тыпы кантэнту могуць мець розныя палі, паводзіны і дазволы, прызначаныя для іх.

source: Indonesia
be: Інданэзія

source: Indonesian
be: Інданезійская

source: Info
be: Інфармацыя

source: Initializing.
be: Ініцыалізацыя

source: Inline
be: Убудаваны

source: Input format
be: Фармат уводу

source: Insert
be: Уставіць

source: Inserted
be: Пастаўлена

source: Inserted into {role_permission} the permissions for role ID !id
be: Устаўленыя ў {role_permission} дазволы для ID ролі !id

source: Install
be: Усталяваць

source: Install from a URL
be: Усталяваць з URL

source: Install new module
be: Усталяваць новы модуль

source: Install new module or theme
be: Усталяваць новы модуль ці тэму

source: Install new theme
be: Усталяваць новую тэму

source: Install profile
be: Усталяваць прафайл.

source: Install site
be: Усталяваць сайт

source: Install with commonly used features pre-configured.
be: Усталяваць са звыклымі наладкамі.

source: Installation failed! See the log below for more information.
be: Усталёўка не атрымалася! Глядзіце ніжэй журнал для атрымання большай інфармацыі.

source: Installation failed! See the log below for more information. Your site is still in maintenance mode.
be: Усталёўка не атрымалася! Глядзіце ніжэй журнал для атрымання большай інфармацыі. Ваш сайт усё яшчэ ў рэжыме эксплуатацыі.

source: Installation was completed successfully.
be: Усталёўка была паспяхова завершаная.

source: Installation was completed successfully. Your site has been taken out of maintenance mode.
be: Усталёўка паспяхова скончана. Ваш сайт выпушчаны ў рэжым эксплуатацыі.

source: Installed
be: Усталявана

source: Installed %module module.
be: Усталяваны %module модуль.

source: Installed %project_name successfully
be: %project_name паспяхова усталяваны

source: Installed version
be: Усталяваная версія

source: Installing %project
be: Усталёўка %project (праекта)

source: Installing @drupal
be: Ідзе інсталляцыя @drupal

source: Installing modules and themes requires <strong>@backends access</strong> to your server. See the <a href="@handbook_url">handbook</a> for other installation methods.
be: Абнаўленне модуляў і тэмаў патрабуе<strong>@backends дасягу</strong> на ваш сервер. Глядзіце пра іншыя метады абнаўлення <a href="@handbook_url">дапаможніку</a>.

source: Installing modules and themes requires access to your server via one of the following methods: <strong>@backends</strong>. See the <a href="@handbook_url">handbook</a> for other installation methods.
be: Усталёўванне модуляў і тэмаў патрабуе дасягу да вашага сэрвера адным з наступных метадаў:<strong>@backends</strong>. Глядзіце <a href="@handbook_url">дапаможнік</a> для іншых спосабаў усталёўкі.

source: Installing new modules and themes through the user interface
be: Устаноўка новых модуляў і тэмаў праз інтэрфейс карыстальніка

source: Installing updates
be: Усталёўка абнаўленняў

source: Instructions to present to the user below this field on the editing form.<br />Allowed HTML tags: @tags
be: Інструкцыі, якія будуць прадстаўленыя карыстальніку ніжэй гэтага поля на форме рэдагавання.<br /> Дазволеныя HTML тэгі: @tags

source: Integer
be: Цэлае

source: Interface
be: Інтэрфейс

source: Interlingua
be: Інтэрлінгуа

source: Interlingue
be: Інтэрлінгуэ

source: Inuktitut
be: Інуктытут

source: Inupiak
be: Інупяк

source: Invalid form POST data.
be: Інфармацыя POST у форме невалідная.

source: Invalid info
be: няправільная інфармацыя

source: Invalid language code.
be: Непрыгодны моўны код.

source: Invalid machine-readable name. Enter a name other than %invalid.
be: Непрыгоднае для счытвання машынай імя. Увядзіце імя, адрознае ад %invalid.

source: Invalid merge query: no conditions
be: Памылковае склейванне запыту: няма умоваў

source: Invalid permission %permission.
be: Недапушчальныя правы %permission.

source: Invalid post.
be: Няправільны запіс.

source: Invalid syntax for system.multicall.
be: Памылка сінтаксісу для system.multicall.

source: Invitation expiry
be: Тэрмін запрашэння выбег

source: Invite a friend
be: Запрасіць сябра

source: Invite page customization
be: Наладкі старонкі запрашэнняў
